tutorials/PFB_3D_resolved_LES/constant/turbulenceProperties
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "constant";
    object      turbulenceProperties;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //


// RANS
/*
simulationType  RAS; //laminar; // RAS;

RAS
{
    RASModel        kOmegaSSTStable;//kOmegaSST;

    turbulence      on;

    printCoeffs     on;
}
*/

simulationType  LES;

LES
{
    LESModel        kOmegaSSTIDDES;

    delta           IDDESDelta; 
    
    IDDESDeltaCoeffs
    {
    }

    turbulence      on;
    printCoeffs     on;
}


// ************************************************************************* //
