tutorials/PFB_3D_resolved_LES/system/force3
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/

forces3
{
    type          forces;
    libs          (forces);

    writeControl  timeStep;
    timeInterval  1;

    patches       ("BB3");
    rho           rhoInf;    
    log           true;
    rhoInf        1;        

    CofR          (0.385 0.23 059);    

}


// ************************************************************************* //
