tutorials/PFB_3D_resolved_LES/system/topoSetDict
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  5                                     |
|   \\  /    A nd           | Web:      www.OpenFOAM.org                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      topoSetDict;
}

// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

actions
(
// 1
    {
        name    b1;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-0.3025  -2  0.45) (-0.2675  2  0.75);
    }
    {
        name    B1; 
        type    faceSet;
        action  new;
        source  faceToFace;
        set     b1;
    }
    {
        name    B1;
        type    faceSet;
        action  subset;      
        source  patchToFace;
        patch   floater;      
    }
    
// 2
    {
        name    b2;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-0.2325  -2  0.45) (-0.1975  2  0.75);
    }
    {
        name    B2; 
        type    faceSet;
        action  new;
        source  faceToFace;
        set     b2;
    }
    {
        name    B2;
        type    faceSet;
        action  subset;      
        source  patchToFace;
        patch   floater;      
    }
    

// 3
    {
        name    b3;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-0.1625  -2  0.45) (-0.1275  2  0.75);
    }
    {
        name    B3; 
        type    faceSet;
        action  new;
        source  faceToFace;
        set     b3;
    }
    {
        name    B3;
        type    faceSet;
        action  subset;      
        source  patchToFace;
        patch   floater;      
    }
    
// 4
    {
        name    b4;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-0.0925  -2  0.45) (-0.0575  2  0.75);
    }
    {
        name    B4; 
        type    faceSet;
        action  new;
        source  faceToFace;
        set     b4;
    }
    {
        name    B4;
        type    faceSet;
        action  subset;      
        source  patchToFace;
        patch   floater;      
    }

// 5
    {
        name    b5;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (-0.0225  -2  0.45) (0.0125  2  0.75);
    }
    {
        name    B5; 
        type    faceSet;
        action  new;
        source  faceToFace;
        set     b5;
    }
    {
        name    B5;
        type    faceSet;
        action  subset;      
        source  patchToFace;
        patch   floater;       
    }
    
// 6
    {
        name    b6;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (0.0475  -2  0.45) (0.0825  2  0.75);
    }
    {
        name    B6; 
        type    faceSet;
        action  new;
        source  faceToFace;
        set     b6;
    }
    {
        name    B6;
        type    faceSet;
        action  subset;      
        source  patchToFace;
        patch   floater;       
    }
    
    
// 7
    {
        name    b7;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (0.1175  -2  0.45) (0.1525  2  0.75);
    }
    {
        name    B7; 
        type    faceSet;
        action  new;
        source  faceToFace;
        set     b7;
    }
    {
        name    B7;
        type    faceSet;
        action  subset;      
        source  patchToFace;
        patch   floater;       
    }
    
// 8
    {
        name    b8;
        type    faceSet;
        action  new;
        source  boxToFace;
        box     (0.1875  -2  0.45) (0.2225  2  0.75);
    }
    {
        name    B8; 
        type    faceSet;
        action  new;
        source  faceToFace;
        set     b8;
    }
    {
        name    B8;
        type    faceSet;
        action  subset;      
        source  patchToFace;
        patch   floater;       
    }


     
);

// ************************************************************************* //
