tutorials/PFB_3D_resolved_LES/system/waveGauges
/*--------------------------------*- C++ -*----------------------------------*\
| =========                 |                                                 |
| \\      /  F ield         | OpenFOAM: The Open Source CFD Toolbox           |
|  \\    /   O peration     | Version:  v2206                                 |
|   \\  /    A nd           | Website:  www.openfoam.com                      |
|    \\/     M anipulation  |                                                 |
\*---------------------------------------------------------------------------*/
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    location    "system";
    object      waveGauges;
}
// * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * * //

waveGauges
{
    type            interfaceHeight;
    libs            ("libfieldFunctionObjects.so");

    alpha           alpha.water;

    interpolationScheme cellPoint;

    locations
    (
        ( -1.6 0.1 0.0 ) // Gauge0
        ( -1.3 0.1 0.0 ) // Gauge1
        ( -0.8 0.1 0.0 ) // Gauge2
        (  0.8 0.1 0.0 ) // Gauge3
        (  1.1 0.1 0.0 ) // Gauge4
        (  1.6 0.1 0.0 ) // Gauge5
    );

    writeControl    adjustableRunTime;
    writeInterval   0.01;
    
    writePrecision  8;
}

// ************************************************************************* //
